#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

google_service_account.service_account: Refreshing state... [id=projects/cloudresume-380001/serviceAccounts/cloud-run-invoker@cloudresume-380001.iam.gserviceaccount.com]
google_compute_global_address.default: Refreshing state... [id=projects/cloudresume-380001/global/addresses/resume]
google_compute_managed_ssl_certificate.default: Refreshing state... [id=projects/cloudresume-380001/global/sslCertificates/cloud-resume-cert]
google_storage_bucket.default: Refreshing state... [id=davidbour-cloud-resume]
google_storage_bucket_iam_member.default: Refreshing state... [id=b/davidbour-cloud-resume/roles/storage.objectViewer/allUsers]
google_compute_backend_bucket.default: Refreshing state... [id=projects/cloudresume-380001/global/backendBuckets/cloud-resume-backend-bucket]
google_project_iam_member.cloudrun-invoker: Refreshing state... [id=cloudresume-380001/roles/run.invoker/serviceAccount:cloud-run-invoker@cloudresume-380001.iam.gserviceaccount.com]
google_api_gateway_api.api_cfg: Refreshing state... [id=projects/cloudresume-380001/locations/global/apis/visitor-api-gateway]
google_firebase_project.default: Refreshing state... [id=projects/cloudresume-380001]
google_project_service.firebase_database: Refreshing state... [id=cloudresume-380001/firebasedatabase.googleapis.com]
google_compute_url_map.default: Refreshing state... [id=projects/cloudresume-380001/global/urlMaps/http-lb]
google_compute_target_https_proxy.default: Refreshing state... [id=projects/cloudresume-380001/global/targetHttpsProxies/cloud-https-proxy]
google_compute_global_forwarding_rule.default: Refreshing state... [id=projects/cloudresume-380001/global/forwardingRules/https-lb-forwarding-rule]
google_api_gateway_api_config.api_cfg: Refreshing state... [id=projects/cloudresume-380001/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg-1]
google_api_gateway_gateway.api_gw: Refreshing state... [id=projects/cloudresume-380001/locations/us-central1/gateways/visitor-api-gateway]
google_firebase_database_instance.default: Refreshing state... [id=projects/cloudresume-380001/locations/us-central1/instances/cloudresume-380001-default-rtdb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # google_api_gateway_api_config.api_cfg must be replaced
+/- resource "google_api_gateway_api_config" "api_cfg" {
      ~ api_config_id        = "visitor-api-gateway-cfg-1" -> "visitor-api-gateway-cfg" # forces replacement
      + api_config_id_prefix = (known after apply)
      ~ display_name         = "visitor-api-gateway-cfg-1" -> (known after apply)
      ~ id                   = "projects/cloudresume-380001/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg-1" -> (known after apply)
      - labels               = {} -> null
      ~ name                 = "projects/650273226296/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg-1" -> (known after apply)
      ~ project              = "cloudresume-380001" -> (known after apply)
      ~ service_config_id    = "visitor-api-gateway-cfg-1-2fxp180o0vqed" -> (known after apply)
        # (1 unchanged attribute hidden)

      + gateway_config { # forces replacement
          + backend_config {
              + google_service_account = "projects/cloudresume-380001/serviceAccounts/cloud-run-invoker@cloudresume-380001.iam.gserviceaccount.com" # forces replacement
            }
        }

        # (1 unchanged block hidden)
    }

  # google_api_gateway_gateway.api_gw will be updated in-place
  ~ resource "google_api_gateway_gateway" "api_gw" {
      ~ api_config       = "projects/650273226296/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg-1" -> (known after apply)
        id               = "projects/cloudresume-380001/locations/us-central1/gateways/visitor-api-gateway"
        name             = "projects/cloudresume-380001/locations/us-central1/gateways/visitor-api-gateway"
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @david-bour, Action: `pull_request`*